Public Attributes | List of all members
API_NavigatorView Struct Reference
Project Navigator
Representation of a Navigator view item. More...
#include <APIdefs_Navigator.h>
 Public Attributes
API_Box  | zoom
The associated zoom box defined in model coordinates. Valid only if the saveZoom field is true.
char  | modelViewOptName [API_LongNameLen]
The name of the model view options as UTF-8 string.
API_ModelViewOptions *  | modelViewOpt
Model View option stored for this view, if custom. Valid only if the saveDispOpt field is true. Do not forget to free this pointer if not needed any more.
API_StructureDisplay  | structureDisplay
The Partial Structure Display state of the view. See API_StructureDisplay.
char  | layerCombination [API_AttrNameLen]
Layer combination name of the view. Valid only if the saveLaySet field is true.
GS::HashTable< API_AttributeIndex, API_LayerStat > *  | layerStats
Handle to a set of layer status stored for the view. Valid only if the saveLaySet field is true and layerCombination is empty, otherwise it should be set to nullptr.
Int32  | drawingScale
The drawing scale associated with the view. Valid only if the saveDScale field is true.
char  | dimName [API_LongNameLen]
Dimension style attribute name. Valid only if the saveDim field is true.
API_DimensionPrefs *  | dimPrefs
Dimensioning settings stored for this view (only if custom). Valid only if the saveDim field is true. Do not forget to free this pointer if not needed any more.
bool  | saveZoom
Zoom box is stored in the view. If false, the zoom field does not contain valid data.
bool  | saveDispOpt
Display options are stored in the view. If false, the displayOpt field does not contain valid data.
bool  | saveLaySet
Layer settings are stored in the view. If false, the layerCombinationand the layerStats fields do not contain valid data.
bool  | saveDScale
Drawing scale is stored in the view. If false, the drawingScalefield does not contain valid data.
bool  | saveDim
Dimensioning is stored in this view. If false, the dimNameand the dimPrefs fields do not contain valid data.
bool  | savePenSet
Store the penset.
bool  | saveStructureDisplay
Partial Structure Display setting is stored in the view.
char  | penSetName [API_AttrNameLen]
Penset name (empty if custom).
GS::Array< API_Pen > *  | pens
Pens of the pen table (only if custom).
bool  | ignoreSavedZoom
If this value is true, the saved zoomBox for the view is not used when changing between views. (in View Organizer this can be set with the "Do not apply saved zooms when changing views" check)
API_Tranmat  | tr
The view transformation (rotation etc.).
API_Guid  | renovationFilterGuid
Renovation filter used by this navigator view.
GS::uchar_t  | overrideCombination [API_UniLongNameLen]
The currently active override combination in this navigator view (or empty string if there is no active override combination).
GS::uchar_t  | d3styleName [API_UniLongNameLen]
3D style name (or empty string if this is not a 3D view).
GS::uchar_t  | renderingSceneName [API_UniLongNameLen]
Rendering scene name (or empty string if this is not a rendered view).
bool  | usePhotoRendering
Use photorendering in visualization (for rendered views).
Detailed Description
Representation of a Navigator view item.
Remarks
You can retrieve information about a view via ACAPI_Navigator_GetNavigatorView and you are able to change it with ACAPI_Navigator_ChangeNavigatorView function.
Member Data Documentation
◆ d3styleName
 API_NavigatorView::d3styleName
3D style name (or empty string if this is not a 3D view).
◆ dimName
 API_NavigatorView::dimName
Dimension style attribute name. Valid only if the saveDim field is true.
◆ dimPrefs
 API_NavigatorView::dimPrefs
Dimensioning settings stored for this view (only if custom). Valid only if the saveDim field is true. Do not forget to free this pointer if not needed any more.
◆ drawingScale
 API_NavigatorView::drawingScale
The drawing scale associated with the view. Valid only if the saveDScale field is true.
◆ ignoreSavedZoom
 API_NavigatorView::ignoreSavedZoom
If this value is true, the saved zoomBox for the view is not used when changing between views. (in View Organizer this can be set with the "Do not apply saved zooms when changing views" check)
◆ layerCombination
 API_NavigatorView::layerCombination
Layer combination name of the view. Valid only if the saveLaySet field is true.
◆ layerStats
 API_NavigatorView::layerStats
Handle to a set of layer status stored for the view. Valid only if the saveLaySet field is true and layerCombination is empty, otherwise it should be set to nullptr.
◆ modelViewOpt
 API_NavigatorView::modelViewOpt
Model View option stored for this view, if custom. Valid only if the saveDispOpt field is true. Do not forget to free this pointer if not needed any more.
◆ modelViewOptName
 API_NavigatorView::modelViewOptName
The name of the model view options as UTF-8 string.
◆ overrideCombination
 API_NavigatorView::overrideCombination
The currently active override combination in this navigator view (or empty string if there is no active override combination).
◆ pens
 API_NavigatorView::pens
Pens of the pen table (only if custom).
◆ penSetName
 API_NavigatorView::penSetName
Penset name (empty if custom).
◆ renderingSceneName
 API_NavigatorView::renderingSceneName
Rendering scene name (or empty string if this is not a rendered view).
◆ renovationFilterGuid
 API_NavigatorView::renovationFilterGuid
Renovation filter used by this navigator view.
◆ saveDim
 API_NavigatorView::saveDim
Dimensioning is stored in this view. If false, the dimNameand the dimPrefs fields do not contain valid data.
◆ saveDispOpt
 API_NavigatorView::saveDispOpt
Display options are stored in the view. If false, the displayOpt field does not contain valid data.
◆ saveDScale
 API_NavigatorView::saveDScale
Drawing scale is stored in the view. If false, the drawingScalefield does not contain valid data.
◆ saveLaySet
 API_NavigatorView::saveLaySet
Layer settings are stored in the view. If false, the layerCombinationand the layerStats fields do not contain valid data.
◆ savePenSet
 API_NavigatorView::savePenSet
Store the penset.
◆ saveStructureDisplay
 API_NavigatorView::saveStructureDisplay
Partial Structure Display setting is stored in the view.
◆ saveZoom
 API_NavigatorView::saveZoom
Zoom box is stored in the view. If false, the zoom field does not contain valid data.
◆ structureDisplay
 API_NavigatorView::structureDisplay
The Partial Structure Display state of the view. See API_StructureDisplay.
◆ tr
 API_NavigatorView::tr
The view transformation (rotation etc.).
◆ usePhotoRendering
 API_NavigatorView::usePhotoRendering
Use photorendering in visualization (for rendered views).
◆ zoom
 API_NavigatorView::zoom
The associated zoom box defined in model coordinates. Valid only if the saveZoom field is true.